DataProcessors/сви_ВыгрузкаЦенБ2БХорошоп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>сви_ВыгрузкаЦенБ2БХорошоп</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдВыгрузки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сви_СхемыОбменаССайтом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДТипЦен</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПакета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/мпи_ЗначенияКатегорийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>мпи_ЗначенияКатегорийНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКатегории</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.мпи_ВидыКатегорийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мпи_КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьШтрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКачество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/сви_ВидыХраненияКатегорийСайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>сви_ВидыХраненияКатегорийСайта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорииНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыЗаполненияЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыЗаполненияЦен</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЦенамНоменклатуры</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЦенамНоменклатурыКонтрагентов</Name>
					<Comment>(Упр)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуреИЦенамКонтрагентов</Name>
					<Comment>(Упр)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРозничнымЦенам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПродажнымЦенам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ТипыЦенНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>(Общ) Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>(Общ) Истина - цена включает НДС, ложь - не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>(Общ) Истина, то при порядке округления "5" 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безнал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПараметрыРасчетаЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦенГараж</Name>
					<Comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрРасчетаЦеныДиски</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПараметрыРасчетаЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦенДиски</Name>
					<Comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенНал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтаройЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/сви_ВыгрузкаЦенБ2БХорошоп/Ext/ObjectModule.bsl
Перем Узел Экспорт;
Перем ТАБ_Штрихкоды Экспорт;

Функция ПолучитьНоменклатуруПоОтбору()
	
	СхемаКомпоновкиДанных = ПолучитьМакет("Макет");

    //создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
    Настройки = Компоновщик.Настройки;
    
    //Формируем макет, с помощью компоновщика макета
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

    //Передаем в макет компоновки схему, настройки и данные расшифровки
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

    //Выполним компоновку с помощью процессора компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

    //Выводим результат в табличный документ
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = Новый ТаблицаЗначений;
    ПроцессорВывода.УстановитьОбъект(Результат);

    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
    Возврат Результат.ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

Функция ПолучитьИзменения()
	
	Узел = СхемаОбмена.УзелПланаОбменаЦены;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НоменклатураИзменения.Ссылка
	|ИЗ
	|	Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
	|ГДЕ
	|	НоменклатураИзменения.Узел = &Узел"
	;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Узел",Узел);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

Процедура ЗаполнитьВсе() Экспорт
	Товары.Очистить();
	
	Узел = Неопределено;
	НомерСообщения = Неопределено;
	
	Если РежимОтбора = "Расширенный" Тогда
		НоменклатураПоОтбору = ПолучитьНоменклатуруПоОтбору();
	Иначе
		НоменклатураПоОтбору = ПолучитьИзменения();
	КонецЕсли;	
	
	Если СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.ГруппыНоменклатуры Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.Родитель.сви_ВыгружатьНаСайт";
		ПодлежитПередаче = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	ИначеЕсли СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.КатегорииНоменклатуры Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 	
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	мпи_ЗначенияКатегорийНоменклатуры.НоменклатураОбъект
		|ИЗ
		|	РегистрСведений.мпи_ЗначенияКатегорийНоменклатуры КАК мпи_ЗначенияКатегорийНоменклатуры
		|ГДЕ
		|	мпи_ЗначенияКатегорийНоменклатуры.ВидКатегории = &ВидКатегории";
		Запрос.УстановитьПараметр("ВидКатегории", СхемаОбмена.ВидКатегорийНоменклатуры);
		ПодлежитПередаче = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НоменклатураОбъект");
	Иначе
		Сообщить("Не указан способ хранения категорий сайта");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ХарактеристикиНоменклатуры.Владелец = СпрНоменклатура.Ссылка)
	|			И (СпрНоменклатура.ВестиУчетПоХарактеристикам)
	|ГДЕ
	|	СпрНоменклатура.ЭтоГруппа = ЛОЖЬ
	|	И СпрНоменклатура.ПометкаУдаления = ЛОЖЬ
	|	И СпрНоменклатура.Ссылка В(&НоменклатураПоОтбору)
	|	И СпрНоменклатура.Ссылка В(&ПодлежитПередаче)";
	Запрос.УстановитьПараметр("НоменклатураПоОтбору",НоменклатураПоОтбору);
	Запрос.УстановитьПараметр("ПодлежитПередаче", ПодлежитПередаче);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		НовСтр = Товары.Добавить();
		НовСтр.Номенклатура = Выборка.Номенклатура;
		НовСтр.Характеристика = Выборка.Характеристика;
	КонецЦикла;
	
	РИН = СхемаОбмена.РеквизитИдентификацииНоменклатуры;
	Если РИН = "ШтрихКод" Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблНоменклатураХарактеристики.Номенклатура,
		|	ТаблНоменклатураХарактеристики.Характеристика
		|ПОМЕСТИТЬ ТаблНоменклатураХарактеристики
		|ИЗ
		|	&ТаблНоменклатураХарактеристики КАК ТаблНоменклатураХарактеристики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штрихкоды.Штрихкод,
		|	Штрихкоды.Владелец КАК Номенклатура,
		|	Штрихкоды.ХарактеристикаНоменклатуры КАК Характеристика
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	(Штрихкоды.Владелец, ЕСТЬNULL(Штрихкоды.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) В
		|			(ВЫБРАТЬ
		|				ТаблНоменклатураХарактеристики.Номенклатура,
		|				ТаблНоменклатураХарактеристики.Характеристика
		|			ИЗ
		|				ТаблНоменклатураХарактеристики КАК ТаблНоменклатураХарактеристики)";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		ТаблНоменклатураХарактеристики = Товары.Выгрузить(,"Номенклатура, Характеристика");
		Запрос.УстановитьПараметр("ТаблНоменклатураХарактеристики", ТаблНоменклатураХарактеристики);
		
		ТАБ_Штрихкоды = Запрос.Выполнить().Выгрузить();
	КонецЕсли;	
КонецПроцедуры	

Процедура ЗаполнитьПоСхемеОбмена() Экспорт
	
	Валюта = СхемаОбмена.ВалютаНоменклатурыИЦенНаСайте;
	
КонецПроцедуры	


Функция ПолучитьШК(Товар,Характеристика)
	Отб = Новый Структура;
	Отб.Вставить("Номенклатура",Товар);
	Отб.Вставить("Характеристика",Характеристика);
	
	Строки_ШК = ТАБ_Штрихкоды.НайтиСтроки(Отб);
	Если Строки_ШК.Количество() Тогда
		Возврат Строки_ШК[0].Штрихкод;
	КонецЕсли;	
	
	Возврат "";
КонецФункции	

Процедура ОбработатьТипЦен(_ТипЦен,КВС,ТЗ,Рез)
	
	РИН = СхемаОбмена.РеквизитИдентификацииНоменклатуры;
	
	СтруктураЗначений = Новый Структура;
	СтруктураЗначений.Вставить("НовыйТипЦен", _ТипЦен);

	ЗапросПоЦенам = Ценообразование.СформироватьЗапросПоЦенам(СтруктураЗначений,
	   Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
	   ТЗ.ВыгрузитьКолонку("Номенклатура"),
	   ТекущаяДата(),
	   Неопределено).Выгрузить();
	ЗапросПоЦенам.Индексы.Добавить("Номенклатура");

	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	ТипЦенРассчитывается = _ТипЦен.Рассчитывается;

	СтруктураКурса = МодульВалютногоУчета.ПолучитьКурсВалюты(Валюта, ТекущаяДата());
	Курс = СтруктураКурса.Курс;
	Кратность = СтруктураКурса.Кратность;

	Для Каждого СтрокаТовара Из ТЗ Цикл
		ХарактеристикаНоменклатуры = СтрокаТовара.Характеристика;

		СтруктураПоиска = Новый Структура("Номенклатура", СтрокаТовара.Номенклатура);

		СтрокиЦен = ЗапросПоЦенам.НайтиСтроки(СтруктураПоиска);

		СтрокаБезХарактеристики = Неопределено;
		СтрокаСХарактеристикой = Неопределено;

		Для Каждого СтрокаЦен Из СтрокиЦен Цикл
			Если СтрокаЦен.ХарактеристикаНоменклатуры = ПустаяХарактеристика Тогда
				СтрокаБезХарактеристики = СтрокаЦен;
			ИначеЕсли СтрокаЦен.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры Тогда
				СтрокаСХарактеристикой = СтрокаЦен;
			КонецЕсли;
		КонецЦикла;

		Если СтрокаСХарактеристикой <> Неопределено Тогда
			НайденнаяСтрока = СтрокаСХарактеристикой;
		ИначеЕсли СтрокаБезХарактеристики <> Неопределено Тогда
			НайденнаяСтрока = СтрокаБезХарактеристики;
		Иначе
			НайденнаяСтрока = Неопределено;
		КонецЕсли;

		Если (НайденнаяСтрока <> Неопределено) И (НайденнаяСтрока.Цена <> 0) Тогда
			Цена = НайденнаяСтрока.Цена * (1 + ?(ТипЦенРассчитывается, НайденнаяСтрока.ПроцентСкидкиНаценки / 100, 0));
			Цена = Ценообразование.ОкруглитьЦену(Цена, _ТипЦен.ПорядокОкругления, _ТипЦен.ОкруглятьВБольшуюСторону);
			Цена = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(Цена, НайденнаяСтрока.ВалютаЦены, Валюта, Курс, Кратность);
		Иначе
			Цена = 0;
		КонецЕсли;

		НовСтр = Товары.Добавить();
		НовСтр.Номенклатура   = СтрокаТовара.Номенклатура;
		НовСтр.Характеристика = СтрокаТовара.Характеристика;
		НовСтр.ТипЦен         = _ТипЦен;
		НовСтр.Цена           = Цена;
		НовСтр.ИДТипЦен       = КВС;
		Если ЗначениеЗаполнено(НовСтр.Характеристика) Тогда
			Если РИН = "ШтрихКод" Тогда
				НовСтр.ИД = ПолучитьШК(НовСтр.Номенклатура,НовСтр.Характеристика);
			Иначе
				НовСтр.ИД = НовСтр.Характеристика.сви_КодВэбСинхронизации;
			КонецЕсли;	
		Иначе
			Если РИН = "ШтрихКод" Тогда
				НовСтр.ИД = ПолучитьШК(НовСтр.Номенклатура,"");
			ИначеЕсли РИН = "Код" Тогда 
				НовСтр.ИД = НовСтр.Номенклатура.Код;
			ИначеЕсли РИН = "Артикул" Тогда 
				НовСтр.ИД = НовСтр.Номенклатура.Артикул;	
			КонецЕсли;
		КонецЕсли;
				
	КонецЦикла;	
	
КонецПроцедуры	

Функция СформироватьДЖС(тзПакет,ТокенСтр) Экспорт
	ВыгружатьНулевыеЦеныB2B = СхемаОбмена.ВыгружатьНулевыеЦеныB2B;	
	ЗаписьДЖС = Новый ЗаписьJSON;
	ЗаписьДЖС.ПроверятьСтруктуру = Истина;
	ПараметрыЗаписиДЖС = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьДЖС.УстановитьСтроку(ПараметрыЗаписиДЖС);
	//ЗаписьДЖС.ОткрытьФайл(ИмяИсходящегоФайла,КодировкаТекста.UTF8,Ложь,ПараметрыЗаписиДЖС);
	
	ЗаписьДЖС.ЗаписатьНачалоОбъекта();
	ЗаписьДЖС.ЗаписатьИмяСвойства("token");
	ЗаписьДЖС.ЗаписатьЗначение(ТокенСтр);
	ЗаписьДЖС.ЗаписатьИмяСвойства("products");
	ЗаписьДЖС.ЗаписатьНачалоМассива();
	
	Для Каждого Стр ИЗ тзПакет Цикл
		Если Стр.МасЦены.Количество() = 0 Тогда Продолжить; КонецЕсли;
		ЗаписьДЖС.ЗаписатьНачалоОбъекта();
		ЗаписьДЖС.ЗаписатьИмяСвойства("article"); 
		ЗаписьДЖС.ЗаписатьЗначение(Стр.ИД);
		ЗаписьДЖС.ЗаписатьИмяСвойства("price");
		ЗаписьДЖС.ЗаписатьЗначение(Стр.ЦенаПрайс);
		ЗаписьДЖС.ЗаписатьИмяСвойства("price_old"); 
		ЗаписьДЖС.ЗаписатьЗначение(Стр.ЦенаСтарая);
		ЗаписьДЖС.ЗаписатьИмяСвойства("price_levels");
		ЗаписьДЖС.ЗаписатьНачалоМассива();
		Для Каждого СтрЦена ИЗ Стр.МасЦены Цикл
			
			Если СтрЦена = 0 И НЕ ВыгружатьНулевыеЦеныB2B Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаписьДЖС.ЗаписатьНачалоОбъекта();
			ЗаписьДЖС.ЗаписатьИмяСвойства("level_id");
		    ЗаписьДЖС.ЗаписатьЗначение(Строка(СтрЦена.ИДТипЦен));
			ЗаписьДЖС.ЗаписатьИмяСвойства("price");
		    ЗаписьДЖС.ЗаписатьЗначение(мпи_Доработки.УбратьШлакИзСтроки(СтрЦена.Цена));
			ЗаписьДЖС.ЗаписатьКонецОбъекта();
		КонецЦикла;	
		ЗаписьДЖС.ЗаписатьКонецМассива();
		
		
		//++ Валюта
		ВалютаИД = Валюта.КодВебСинхронизации;
		ВалютаСтр = Валюта.Наименование;
		Если Валюта.Код = "980" Тогда //часто используется "грн." в наименовании, а надо слать "UAH"
			ВалютаСтр = "UAH";
		КонецЕсли;
		ЗаписьДЖС.ЗаписатьИмяСвойства("currency");
		Если НЕ ЗначениеЗаполнено(ВалютаИД)Тогда
			ЗаписьДЖС.ЗаписатьЗначение(ВалютаСтр);
		Иначе
			ЗаписьДЖС.ЗаписатьНачалоОбъекта();
			ЗаписьДЖС.ЗаписатьИмяСвойства("id");
			ЗаписьДЖС.ЗаписатьЗначение(ВалютаИД);
			ЗаписьДЖС.ЗаписатьКонецОбъекта();
		КонецЕсли;
		//
		
		ЗаписьДЖС.ЗаписатьКонецОбъекта();
	КонецЦикла;
	
	ЗаписьДЖС.ЗаписатьКонецМассива(); // товары
	ЗаписьДЖС.ЗаписатьКонецОбъекта();
	
	Рез = ЗаписьДЖС.Закрыть();
	
	Возврат Рез;
	
КонецФункции	

Процедура Пауза(ЗадержкаСекунд)
	СтрокаЗапроса = "ping -n 1 -w "+Формат(1000 * ЗадержкаСекунд, "ЧДЦ=0; ЧГ=") + " 127.255.255.255"; 
	WshShell = Новый COMОбъект("WScript.Shell"); 
	WshShell.Run(СтрокаЗапроса, 0, -1); 
КонецПроцедуры	

Функция ВыгрузитьЦены() Экспорт
	
	Рез = Новый Структура;
	Рез.Вставить("Успешно",Истина);
	Рез.Вставить("Сообщение","");
	
	ТЦ_Прайс  = СхемаОбмена.ТипЦеныПрайс;
	ТЦ_Старая = СхемаОбмена.ТипЦеныСтарая;
	
	ТЗ = Товары.Выгрузить(,"Номенклатура,Характеристика");
	Товары.Очистить();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТипыЦенНоменклатурысви_КодыМагазинов.Ссылка,
	|	ТипыЦенНоменклатурысви_КодыМагазинов.КодВэбСинхронизации КАК КВС
	|ИЗ
	|	Справочник.ТипыЦенНоменклатуры.сви_КодыМагазинов КАК ТипыЦенНоменклатурысви_КодыМагазинов
	|ГДЕ
	|	ТипыЦенНоменклатурысви_КодыМагазинов.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТипыЦенНоменклатурысви_КодыМагазинов.Магазин = &Магазин"
	;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Магазин",Справочники.Подразделения.НайтиПоРеквизиту("сви_СхемаОбменаССайтом",СхемаОбмена));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.КВС) Тогда Продолжить; КонецЕсли;
		ОбработатьТипЦен(Выборка.Ссылка,Выборка.КВС,ТЗ,Рез);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТЦ_Прайс) Тогда
		ОбработатьТипЦен(ТЦ_Прайс,"",ТЗ,Рез);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТЦ_Старая) Тогда
		ОбработатьТипЦен(ТЦ_Старая,"",ТЗ,Рез);
	КонецЕсли;
	
	НП = СхемаОбмена.НастройкаПодключения;
	ТокенРез = мпи_Доработки.ПолучитьТокен_Хорошоп(НП);
	Если ТокенРез.Статус = "OK" Тогда
		ТокенСтр = ТокенРез.Токен; 
	Иначе
		Сообщить(ТокенРез.Сообщение);
		Рез.Вставить("Сообщение",ТокенРез.Сообщение);
		Возврат Рез;
	КонецЕсли;
	
	Пауза(1);
	
	РазмерПакета = СхемаОбмена.РазмерПакетаПереаваемыхДанных;
	Если РазмерПакета=0 Тогда РазмерПакета=300; КонецЕсли;
	НомерПакета = 0;
	
	Пока ИСТИНА Цикл
		
		НомерПакета = НомерПакета + 1;
		КвоВПакете = 0;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТабТовары.Номенклатура,
		|	ТабТовары.Характеристика,
		|	ТабТовары.ИД,
		|	ТабТовары.НомерПакета,
		|	ТабТовары.ТипЦен,
		|	ТабТовары.ИДТипЦен,
		|	ТабТовары.Цена
		|ПОМЕСТИТЬ ТабТовары
		|ИЗ
		|	&ТабТовары КАК ТабТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабТовары.Номенклатура КАК Номенклатура,
		|	ТабТовары.Характеристика КАК Характеристика,
		|	ТабТовары.ТипЦен,
		|	ТабТовары.ИДТипЦен,
		|	ТабТовары.Цена,
		|	ТабТовары.ИД КАК ИД
		|ИЗ
		|	ТабТовары КАК ТабТовары
		|ГДЕ
		|	ТабТовары.НомерПакета = 0
		|ИТОГИ ПО
		|	Номенклатура,
		|	Характеристика,
		|	ИД"
		;
		//
		тзПакет = Новый ТаблицаЗначений;
		тзПакет.Колонки.Добавить("Номенклатура");
		тзПакет.Колонки.Добавить("Характеристика");
		тзПакет.Колонки.Добавить("ИД");
		тзПакет.Колонки.Добавить("ЦенаПрайс");
		тзПакет.Колонки.Добавить("ЦенаСтарая");
		тзПакет.Колонки.Добавить("МасЦены");
		
		//
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ТабТовары",Товары);
		ВыборкаНом = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаНом.Количество() = 0 Тогда Прервать; КонецЕсли;
		Пока ВыборкаНом.Следующий() Цикл
			ВыборкаХар = ВыборкаНом.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаХар.Следующий() Цикл
				ВыборкаИД = ВыборкаХар.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаИД.Следующий() Цикл
					КвоВПакете = КвоВПакете+1;
					НовСтр = тзПакет.Добавить();
					НовСтр.Номенклатура   = ВыборкаИД.Номенклатура;
					НовСтр.Характеристика = ВыборкаИД.Характеристика;
					НовСтр.ИД = ВыборкаИД.ИД;
					НовСтр.ЦенаПрайс = 0;
					НовСтр.ЦенаСтарая = 0;
					МасЦены = Новый Массив;
					ВыборкаДетально = ВыборкаИД.Выбрать();
					Пока ВыборкаДетально.Следующий() Цикл
						Если ВыборкаДетально.ТипЦен = ТЦ_Прайс Тогда
							НовСтр.ЦенаПрайс = ВыборкаДетально.Цена;
							Продолжить;
						КонецЕсли;
						Если ВыборкаДетально.ТипЦен = ТЦ_Старая Тогда
							НовСтр.ЦенаСтарая = ВыборкаДетально.Цена;
							Продолжить;
						КонецЕсли;
						стЦена = Новый Структура;
						стЦена.Вставить("ИДТипЦен",ВыборкаДетально.ИДТипЦен);
						стЦена.Вставить("Цена",ВыборкаДетально.Цена);
						МасЦены.Добавить(стЦена);
					КонецЦикла; // по типам цен
					НовСтр.МасЦены = МасЦены;
					Если КвоВПакете >= РазмерПакета Тогда Прервать; КонецЕсли;
				КонецЦикла;
				Если КвоВПакете >= РазмерПакета Тогда Прервать; КонецЕсли;
			КонецЦикла;
			Если КвоВПакете >= РазмерПакета Тогда Прервать; КонецЕсли;
		КонецЦикла;
		
		ТелоЗапроса = СформироватьДЖС(тзПакет,ТокенСтр);		
		
		Если НП.ЗащищенноеСоединение Тогда
			Порт = 443;
			ЗС   = Новый ЗащищенноеСоединениеOpenSSL; 
		Иначе
			ЗС 	 = Неопределено;
			Порт = 80;
		КонецЕсли;
		Прокси     = Новый ИнтернетПрокси(Ложь);		
		Соединение = Новый HTTPСоединение(НП.Адрес,Порт, , , Прокси,,ЗС);
		
		Заголовки = Новый Соответствие();
		Заголовки.Вставить("Content-Type","application/json");
				
		Сервис = "/api/catalog/import/";
		ЗапросHTTP = Новый HTTPЗапрос(Сервис,Заголовки);
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса,,ИспользованиеByteOrderMark.НеИспользовать);
		РезультатЗапроса = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
		
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			Т = "Ошибка выполнения. Код "+РезультатЗапроса.КодСостояния;
			Т = Т+Символы.ПС+РезультатЗапроса.ПолучитьТелоКакСтроку();
			Рез.Вставить("Сообщение",Т);
			Сообщить(Т);
			Возврат Рез;
		КонецЕсли;
		
		Данные = РезультатЗапроса.ПолучитьТелоКакСтроку();
		
		ЧтениеДЖС = Новый ЧтениеJSON;
		ЧтениеДЖС.УстановитьСтроку(Данные);
		Записи = ПрочитатьJSON(ЧтениеДЖС);
		Статус = ""; МассивОтвет = Новый Массив;
		Для Каждого Запись Из Записи Цикл
			Если Запись.Ключ = "status" Тогда
				Статус = Запись.Значение;
			КонецЕсли;
			Если Запись.Ключ = "response" Тогда
				МассивОтвет = Запись.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если (Статус = "ERROR")  ИЛИ (Статус = "HTTP_ERROR") Тогда
			МассивЗначенийЛога = Новый Массив;
			Для Каждого Эл Из МассивОтвет Цикл
				МассивЗначенийЛога = Эл.Значение;
			КонецЦикла;
			Сообщить(МассивЗначенийЛога);
			Рез.Вставить("Сообщение",МассивЗначенийЛога);
			Возврат Рез;
		КонецЕсли;
				
		//Узел = Подразделение.сви_СхемаОбменаССайтом.УзелПланаОбменаЦены;
		
		Для Каждого Эл ИЗ Записи.response.log Цикл
			КодОтвета = Эл.info[0].code;
			ТекстОтвета = Эл.info[0].message;
			Отб = Новый Структура("ИД",Эл.article);
			НайденныеСтроки = Товары.НайтиСтроки(Отб);
			Для Каждого Стр ИЗ НайденныеСтроки Цикл
				Стр.КодОтвета   = КодОтвета;
				Стр.ТекстОтвета = ТекстОтвета;
				Стр.Результат   = Статус;
				Стр.НомерПакета = НомерПакета;
				Если СокрЛП(КодОтвета) = "0" И ЗначениеЗаполнено(Узел) Тогда
					ПланыОбмена.УдалитьРегистрациюИзменений(Узел,Стр.Номенклатура);
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;	
				
	КонецЦикла;	
	
КонецФункции	

Функция СоздатьHTTPСоединение(НастройкиПодключений) Экспорт
	
	Если НастройкиПодключений.ЗащищенноеСоединение Тогда
		Порт    = 443;
		ЗС 		= Новый ЗащищенноеСоединениеOpenSSL; 
	Иначе
		Порт    = 80;
		ЗС 		= Неопределено; 
	КонецЕсли;
	
	Адрес          = НастройкиПодключений.Адрес;
	Пользователь   = НастройкиПодключений.ИмяПользователя;
	Пароль         = НастройкиПодключений.Пароль;
	ИнтернетПрокси = Неопределено;
	АдресСкриптаАутентификация = СокрЛП(НастройкиПодключений.АдресСкриптаАутентификация);
	
	Соединение = Новый HTTPСоединение(Адрес, Порт, , , ИнтернетПрокси,,ЗС);
	
	Возврат Соединение;
	
КонецФункции

Схема = ПолучитьМакет("Макет");
Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
Компоновщик.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
